// Программа: "Преобразование данных".
"use strict";
// Создаем строку с числами с строками.
var str = "Windows10Ubuntu17Android8";
// Преобразовываем строку в массив.
var arr = [];
arr.push(str);
// Проверяем длинну массива
console.log(arr[0].length);
console.log(arr);
// Создаем два новых пустых массива.
var newArr1 = [],
    newArr2 = [];

// Проходимся по каждому символу в индексе 0.
for (var i = 0; i < arr[0].length; i++) {
    newArr1.push(arr[0][i]);
} 
console.log(newArr1);

// Разделяем полученный массив на два

// Преобразовываем строчный массив обратно в строку с разделителями

// Увеличиваем числовой массив в 2 раза

// Выводим исходный массив

// Выводим измененный массив

