// Программа: "Расчет стоимости поездки в метро"
"use strict";
// Создаем обьект с массивом данных
var card = {
  cost: [4.00, 3.90, 3.80, 3.70, 3.60],
  trips: {
        start: [1, 2, 3, 4, 5, 6, 7, 8, 9],
        next: [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
        middle: [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
        big: [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
        biggest: [40, 41, 42, 43, 44, 45, 46, 47, 48, 49]
        }
}
// Получаем информацию о сумме пополнения
var user = +prompt("Введите сумму пополнения:", "");
// Запускаем цикл поиска в обьекте необходимой информации
var count = 0;
for (var key in card) {
  for (var i = 0; i < card[key].length; i++) {
    count += 1;
    console.log(card[key][i]);
  }
}

// Выводим информацию о количестве поездок
console.log();
console.log("--------------------------------------------");
// Выводим информацию о стоимости проезда
console.log();
console.log("--------------------------------------------");
// Выводим информацию о сдаче
console.log();
console.log("--------------------------------------------");